Catalogs/АС_БрендыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АС_БрендыТоваров</Name>
			<Comment>Бренды товаров с вариантами написания для поиска.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АС_Синонимы</Name>
					<Comment>Варианты написания бренда, разделённые запятыми.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АС_УсловноИспользоватьОбработчик</Name>
					<Comment>Преобразовывать наименование автоматически: первая буква заглавная, остальные строчные.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АС_БрендыТоваров/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура АС_ИмпортироватьTXT(Команда)

	Оповещение = Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтотОбъект);
	ФайловаяСистемаКлиент.ЗагрузитьФайл(Оповещение);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораФайла(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Или Результат.Количество() = 0
		Или Не ЗначениеЗаполнено(Результат.Хранение) Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Итог = ИмпортироватьTXTНаСервере(Результат.Хранение);
		ОбщегоНазначенияКлиент.СообщитьПользователю(Итог);
		Элементы.Список.Обновить();
		Оповестить("АС_БрендыТоваровИзменены");
	Исключение
		ПоказатьПредупреждение(, "Не удалось импортировать TXT:" + Символы.ПС
			+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция ИмпортироватьTXTНаСервере(Адрес)

	ДвоичныеДанныеTXT = ПолучитьИзВременногоХранилища(Адрес);
	ТекстTXT = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеTXT, КодировкаТекста.UTF8);
	Бренды = ПолучитьБрендыПоКлючу();
	Добавлено = 0;
	Обновлено = 0;
	БезИзменений = 0;
	Пропущено = 0;

	Для Каждого СтрокаTXT Из СтрРазделить(ТекстTXT, Символы.ПС, Ложь) Цикл
		СтрокаTXT = СокрЛП(СтрЗаменить(СтрокаTXT, Символы.НПП, ""));
		Если ПустаяСтрока(СтрокаTXT) Тогда
			Продолжить;
		КонецЕсли;

		ПозицияРазделителя = СтрНайти(СтрокаTXT, " - ");
		Если ПозицияРазделителя = 0 Тогда
			Пропущено = Пропущено + 1;
			Продолжить;
		КонецЕсли;

		НаименованиеБренда = СокрЛП(Лев(СтрокаTXT, ПозицияРазделителя - 1));
		СинонимыБренда = СокрЛП(Сред(СтрокаTXT, ПозицияРазделителя + 3));
		Если ПустаяСтрока(НаименованиеБренда) Тогда
			Пропущено = Пропущено + 1;
			Продолжить;
		КонецЕсли;

		КлючБренда = КлючНаименования(НаименованиеБренда);
		СсылкаБренда = Бренды.Получить(КлючБренда);
		Если СсылкаБренда = Неопределено Тогда
			ОбъектБренда = Справочники.АС_БрендыТоваров.СоздатьЭлемент();
			ОбъектБренда.АС_УсловноИспользоватьОбработчик = Ложь;
			ОбъектБренда.Наименование = НаименованиеБренда;
			ОбъектБренда.АС_Синонимы = Лев(СинонимыБренда, 500);
			ОбъектБренда.Записать();
			Бренды.Вставить(КлючБренда, ОбъектБренда.Ссылка);
			Добавлено = Добавлено + 1;
		Иначе
			ОбъектБренда = СсылкаБренда.ПолучитьОбъект();
			НовыеСинонимы = ОбъединитьСинонимы(ОбъектБренда.АС_Синонимы, СинонимыБренда);
			Если НовыеСинонимы = ОбъектБренда.АС_Синонимы
				И ОбъектБренда.Наименование = НаименованиеБренда
				И Не ОбъектБренда.АС_УсловноИспользоватьОбработчик Тогда
				БезИзменений = БезИзменений + 1;
			Иначе
				ОбъектБренда.АС_УсловноИспользоватьОбработчик = Ложь;
				ОбъектБренда.Наименование = НаименованиеБренда;
				ОбъектБренда.АС_Синонимы = НовыеСинонимы;
				ОбъектБренда.Записать();
				Обновлено = Обновлено + 1;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат СтрШаблон(
		"Импорт завершён. Добавлено: %1, обновлено: %2, без изменений: %3, пропущено строк: %4.",
		Добавлено, Обновлено, БезИзменений, Пропущено);

КонецФункции

&НаСервере
Функция ПолучитьБрендыПоКлючу()

	Результат = Новый Соответствие;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|  Бренды.Ссылка КАК Ссылка,
		|  Бренды.Наименование КАК Наименование
		|ИЗ
		|  Справочник.АС_БрендыТоваров КАК Бренды
		|ГДЕ
		|  НЕ Бренды.ПометкаУдаления");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ключ = КлючНаименования(Выборка.Наименование);
		Если Результат.Получить(Ключ) = Неопределено Тогда
			Результат.Вставить(Ключ, Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Возврат Результат;

КонецФункции

&НаСервере
Функция КлючНаименования(Значение)

	Возврат ВРег(СокрЛП(СтрЗаменить(Строка(Значение), Символы.НПП, " ")));

КонецФункции

&НаСервере
Функция ОбъединитьСинонимы(ТекущиеСинонимы, НовыеСинонимы)

	Результат = СокрЛП(Строка(ТекущиеСинонимы));
	Ключи = Новый Соответствие;
	Для Каждого Синоним Из СтрРазделить(Результат, ",", Ложь) Цикл
		Если Не ПустаяСтрока(СокрЛП(Синоним)) Тогда
			Ключи.Вставить(КлючНаименования(Синоним), Истина);
		КонецЕсли;
	КонецЦикла;

	Для Каждого Синоним Из СтрРазделить(Строка(НовыеСинонимы), ",", Ложь) Цикл
		Синоним = СокрЛП(Синоним);
		Если Не ПустаяСтрока(Синоним)
			И Ключи.Получить(КлючНаименования(Синоним)) = Неопределено Тогда
			Результат = Результат + ?(ПустаяСтрока(Результат), "", ", ") + Синоним;
			Ключи.Вставить(КлючНаименования(Синоним), Истина);
		КонецЕсли;
	КонецЦикла;

	Возврат Лев(Результат, 500);

КонецФункции
